ovelhaaa/voxP4/sdkconfig.defaults
# Reproducible firmware target. Other project settings retain ESP-IDF defaults.
CONFIG_IDF_TARGET="esp32p4"
CONFIG_IDF_TARGET_ESP32P4=y

# PSRAM configuration for ESP32-P4. This file owns the production default:
# 32 MB HEX device at 200 MHz (B4C.7 qualified the switch from 20 MHz).
# CONFIG_SPIRAM_SPEED_200M is gated on CONFIG_IDF_EXPERIMENTAL_FEATURES in
# ESP-IDF v5.3 (components/esp_psram/esp32p4/Kconfig.spiram); both are set.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
# CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY is not set

# CPU Frequency and FreeRTOS
CONFIG_ESP32P4_DEFAULT_CPU_FREQ_360=y
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

# Profiling and Operation Mode
CONFIG_VOCAL_FX_ENABLE_PROFILING=y
CONFIG_VOXP4_MODE_I2S_B4D_1_QUALIFICATION=y
CONFIG_VOXP4_B4B6_MEASURE_SECONDS=10
CONFIG_VOXP4_B4B6_STABILITY_SECONDS=60
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y

# Normal Task Watchdog configuration (retained)
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=5
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=y
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=y

# Chip Revision support for ESP32-P4 production silicon (rev v1.3)
CONFIG_ESP32P4_REV_MAX_FULL=199
CONFIG_ESP_REV_MAX_FULL=199
